Revit 2024 API
NullParameterValue Class
 A class that represent an empty (null) value of a parameter element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public class NullParameterValue : ParameterValue
Visual Basic
Public Class NullParameterValue _
	Inherits ParameterValue
Visual C++
public ref class NullParameterValue : public ParameterValue
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.NullParameterValue
See Also
NullParameterValue Members
Autodesk.Revit.DB Namespace